const doramas = {
    0: {
        "id": 0,
        "title": "Младший сын семьи Чеболей дорама ",
        "description": "Главный герой Юн Хён У много лет работает на влиятельную семью Sunyang Group. Он выполняет разные поручения, не задает вопросов и никогда не отказывает, за что и держится на должности так долго. Но однажды он становится свидетелем предательства, и за это его приказывают убить.После смерти молодого человека происходит что-то странное: дух убитого переселяется в тело одного из младших сыновей этой семьи. Теперь Юн Хён У полон желания отомстить и он решительно настроен разобраться со своими обидчиками.",
        "year": 2022,
        "country": "Южная Корея",
        "genres": ["Драма", "Мелодрама", "Фантастика"],
        "img": "https://doramy.club/wp-content/uploads/2022/11/mladshij-syn-semi-chebolej.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/yBswVsczWNk ",
            "title": "тизер к  дораме «младший сын семьи чеболей"
        }
        },
    1: {
        "id": 1,
        "title": "Любовь, которую ты даришь мне",
        "description": "В жизни главной героини Мин Хуэй был тяжелый период. Однажды она захотела покончить жизнь самоубийством, но случайная знакомая — Су Тянь, которая ехала на встречу со свом другом детства, спасает ее, а сама погибает.В жизни главной героини Мин Хуэй был тяжелый период. Однажды она захотела покончить жизнь самоубийством, но случайная знакомая — Су Тянь, которая ехала на встречу со свом другом детства, спасает ее, а сама погибает.Чтобы избавиться от чувства вины, Мин Хуэй хотела исполнить последнее желание погибшей — встретиться с этим мужчиной и объясниться. Но судьба сыграла с ними злую шутку: Син Ци принял её за давнюю подругу, она не стала его разубеждать, и скоро молодые люди полюбили друг друга.Когда правда была раскрыта, Син Ци возненавидел возлюбленную. Спустя пять лет они встречаются снова, и Мин Хуэй делает все возможное, чтобы добиться его расположения, ведь ее жизнь после их встречи сильно изменилась!",
        "year": 2023,
        "country": "Китай",
        "genres": ["Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2023/04/lyubov-kotoruyu-ty-darish-mne-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    2: {
        "id": 2,
        "title": "Любовная битва",
        "description": "Ё Ми Ран не верит в любовь и романтику. Днем она работает адвокатом, а вечерами часто ввязывается в драки, чтобы наказать преступников кулаками. Постоянного парня у нее нет, так как она предпочитает короткие интрижки и делит всех мужчин на типажи.Однажды Ё Ми Ран встречает Нам Ган Хона – популярного актера, который играет в романтических сериалах, но не доверяет женщинам, считая, что они продажные и ищут богатых мужчин.Пара вступает в нешуточную битву, пытаясь доказать друг другу, что ошибаются в своем отношении к противоположному полу. Постепенно битва перерастет в нечто большое, и взгляды у молодых людей переменятся.",
        "year": 2023,
        "country": "Южная Корея",
        "genres": ["Мелодрама", "Комедия"],
        "img": "https://doramy.club/wp-content/uploads/2023/02/lyubovnaya-bitva-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/xT1j-Hj6lyE",
            "title": "Отрывки из дорамы Любовная битва"
        }
    },
    3: {
        "id": 3,
        "title": "Ты в моём сердце",
        "description": "Сюжет сериала «Ты в моём сердце» рассказывает историю между двумя людьми, чьи отношения не заладились еще с детства. Пум была толстоватой девочкой и частенько выслушивала насмешки со стороны Нына. Спустя годы им снова суждено встретиться, только на этот раз все изменилось. Пум окончила университет, устроилась на работу и стала настоящей красавицей. Нын так же закончил учебу за границей и вернулся на родину.На одной из вечеринок, он встречает нашу красавицу, но даже не подозревает, что это девчонка над которой он издевался в детстве. Пум хорошо знает, с кем она встретилась и отказывается с ним потанцевать. Нын влюбляется в девушку и даже, когда узнает, кто она на самом деле ничего не может поделать со своими чувствами. Чтобы узнать, как будут складываться их дальнейшие отношения, смотрите сериал.",
        "year": 2015,
        "country": "Таиланд",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2018/07/ty-v-moyom-serdce-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/MDx-UmMKauI",
            "title": "Отрывки из дорамы Ты в моём сердце"
        }
    },
    4: {
        "id": 4,
        "title": "Фея тяжёлой атлетики Ким Бок Чжу ",
        "description": "В основу романтической дорамы «Фея тяжёлой атлетики Ким Бок Чжу» заложена реальная история южнокорейского тяжелоатлета Чан Ми Рана. Дочь выдающегося спортсмена Ким Бок Чжу по-настоящему удивляет своими физическими способностями. Впервые девочка начала подымать штангу в десять лет и с того момента было ясно, что малютка Бок Чжу пойдет по стопам своего выдающегося отца. Однако, несмотря на весь спортивный потенциал, героиня все равно остается милой и очень женственной девушкой. Однажды она знакомится с доктором Чон Дже, который помогает людям избавиться от лишнего веса. Бок Чжу весьма упитанная девушка и роковое знакомство с доктором может стать ее счастливой судьбой.",
        "year": 2016,
        "country": "Южная Корея",
        "genres": ["Комедия", "Спорт"],
        "img": "https://doramy.club/wp-content/uploads/2017/05/feya-shtangistka-kim-bok-chu.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/4DObf4Cm1wY",
            "title": "Отрывки из дорамы Фея тяжёлой атлетики Ким Бок Чжу"
        }
    },
    5: {
        "id": 5,
        "title": "Дворец (тайская версия) ",
        "description": "Наследный принц Ин вынужден жениться на обычной девушке Канин, которая мечтает стать знаменитой художницей и не любит условности. Все дело в том, что отец короля дал слово своему другу, который служил у него в охране, что они породнятся. Ни жених ни невеста не в восторге от происходящего, но Канин нужны деньги, а Ин должен сдержать слово деда. Смогут ли эти двое стать ближе, ведь принц уже влюблен, а его будущая невеста никак не может справиться с ограничениями дворца. Вдобавок двоюродный брат Ина намерен вернуть себе трон, который он потерял после смерти отца и претендует на руку и сердце Канин.",
        "year": 2017,
        "country": "Таиланд",
        "genres": ["Драма", "Мелодрама", "Комедия"],
        "img": "https://doramy.club/wp-content/uploads/2017/05/dvorec-tajskaya-versiya-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    6: {
        "id": 6,
        "title": "W: Меж двух миров",
        "description": "Фантастическая дорама «W: Меж двух миров» рассказывает удивительную историю двух людей из разных миров. Милая и успешная девушка Ён Джу работает интерном в одной из клиник Сеула. Однажды судьба сведет ее с успешным парнем Кан Чолем, который является главным героем одного детективного шоу. Однако в жизни Кан Чоля есть трагическая история, которая не дает ему покоя уже много лет. В юности были жестоко убиты его родители, и полиция так и не смогла раскрыть это преступление. Кан Чоль начал раскрывать другие преступления, в которых были обвиненные невинные люди. За годы своей практики он стал весьма популярным и запустил детективное шоу. Фантастическим образом Ён Джу встретиться с Кан Чолем.",
        "year": 2016,
        "country": "Южная Корея",
        "genres": ["Драма", "Мелодрама", "Триллер", "Фантастика"],
        "img": "https://doramy.club/wp-content/uploads/2017/05/w-mezh-dvux-mirov.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/3DkUHlgZNio",
            "title": "Отрывки из дорамы W: Меж двух миров"
        }
    },
    7: {
        "id": 7,
        "title": "Прощайте, счастливые дни",
        "description": "Молодая пара заносила многочисленные коробки в очередную квартиру, чтобы снова взяться за обустройство своей жизни, а со стороны Кэйти и Акира казались молодоженами, не так давно соединившими свои судьбы, да ещё и весьма юными. Впрочем, влюбленные давно уже вели вполне взрослую жизнь. Девушка работала воспитательницей, а её спутник жизни занимал должность редактора в издательстве. За закрытыми дверьми своей квартиры они продолжали ощущать себя теми, кем их видели окружающими: мужем и женой, вот только у них имелась тайна, способная сокрушить приятные впечатления об их маленькой семье, поскольку Кэйти и Акира приходились друг другу братом и сестрой, у которых с малых лет установилась особенная связь.",
        "year": 2023,
        "country": "Япония",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2023/07/proshhajte-schastlivye-dni-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    8: {
        "id": 8,
        "title": "Влюбиться в твою улыбку",
        "description": "Сюжет дорамы «Влюбиться в твою улыбку» разворачивается вокруг студентки по имени Тун Яо. Она вошла в профессиональный мир киберспорта, став первой девушкой в лиге Китая. Героине придётся столкнуться с большим количеством испытаний на пути к успеху, ведь даже члены её команды поначалу не верили в неё. Кроме того, Тун Яо давно для себя решила, что точно не хочет иметь близких отношений с киберспортсменом, однако капитан её команды весьма привлекателен, да и, по всей видимости, тоже находит девушку интересной.",
        "year": 2021,
        "country": "Китай",
        "genres": ["Мелодрама", "Комедия", "Спорт"],
        "img": "https://doramy.club/wp-content/uploads/2021/06/vlyubitsya-v-tvoyu-ulybku-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/2WRZEed4imM",
            "title": "Отрывки из дорамы Влюбиться в твою улыбку"
        }
    },
    9: {
        "id": 9,
        "title": "Бешеные псы | Бешеный пес",
        "description": "Действия дорамы «Бешеные псы» разворачиваются вокруг крушения авиалайнера. Чхве Кан У расследует страховые мошенничества, которые в последнее время значительно участились. Ради больших денег люди порой идут на самые ужасные поступки. Его задача выявить такие случаи и найти доказательства обмана. Произошло крушение большого самолета погибло много пассажиров. Эта трагедия на прямую затронула Кан У, который уверен, что авиакатастрофа подстроена ради получения огромной страховки. Мужчина собирает команду, чтобы расследовать обстоятельства крушения и вывести на чистую воду преступников.",
        "year": 2017,
        "country": "Южная Корея",
        "genres": ["Детектив", "Драма"],
        "img": "https://doramy.club/wp-content/uploads/2017/10/beshenyj-pes1-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/6RP4P6NkQmU",
            "title": "Отрывки из дорамы Бешеный пес"
        }
    },
    10: {
        "id": 10,
        "title": "Мистер Совершенство и мисс Ничего особенного",
        "description": "Сюжет дорамы «Мистер Совершенство и мисс Ничего особенного» разворачивается вокруг гениального, но холодного и серьезного профессора Чжан Синяня. Однажды он встречает Юнь Шу. И какого же было удивление девушки, когда она узнала в этом мужчине своего университетского лектора. Обстоятельства сложились так, что герои заключили фиктивный брак, однако им приходится скрывать свои отношения от окружающих. Смогут ли совместный быт и проживание сыграть свою роль в их отношениях? Будут ли развиваться их искренние чувства?",
        "year": 2020,
        "country": "Китай",
        "genres": ["Мелодрама", "Комедия"],
        "img": "https://doramy.club/wp-content/uploads/2020/10/mister-sovershenstvo-i-miss-nichego-osobennogo-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    11: {
        "id": 11,
        "title": "Первая любовь ",
        "description": "Ногути Яэ и Намики Харумичи познакомились в старшей школе и влюбились друг в друга. Они вместе хотели осуществить свои мечты, но в итоге Яэ попала в серьезную аварию, из-за которой потеряла память, и их пути разошлись.Спустя много лет судьба снова сводит эту пару вместе. У Яэ взрослый сын, у Харумичи тоже своя жизнь, но он понимает, что чувства никуда не делись. Он по-прежнему любит Яэ и пытается сделать все, чтобы она его вспомнила.",
        "year": 2022,
        "country": "Япония",
        "genres": ["Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2022/11/pervaya-lyubov-2022-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    12: {
        "id": 12,
        "title": "Ты коснулась моего сердца",
        "description": "У главной героини Аньямани была очень большая влиятельная семья. Но она никогда не считала себя ее частью, так как кроме матери девушку никто не любил и не считался с ее мнением. Как только ей предоставился шанс, она уехала учиться заграницу.При возвращении в Тайланд девушка встречает симпатичного молодого человека Куакхуна. Герои влюбляются друг в друга, но и здесь ее семья вмешивается и мешает их счастью. Оказывается, возлюбленный Аньямани — главный конкурент семейного бизнеса, а еще его подозревают в смерти брата девушки.",
        "year": 2023,
        "country": "Таиланд",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2023/01/ty-kosnulas-moego-serdca-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    13: {
        "id": 13,
        "title": "Поцелуй шестого чувства ",
        "description": "Главная героиня Хон Йе Соль обладает уникальными способностями: как только девушка целует человека, она видит его будущее. Однажды Йе Соль случайно коснулась губами шеи своего босса и увидела нечто странное: в будущем они будут счастливы вместе. Девушка не может в это поверить, ведь босс не отличается добрым нравом, все время критикует ее, заставляет много работать. Она не согласна с такой судьбой и готова во чтобы то ни стало ее изменить. Получится ли у нее это сделать, или все давным-давно определено, узнаем после просмотра дорамы, которая обещает быть увлекательной.",
        "year": 2022,
        "country": "Южная Корея",
        "genres": ["Мелодрама", "Комедия", "Фантастика"],
        "img": "https://doramy.club/wp-content/uploads/2022/04/poceluj-shestogo-chuvstva-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    14: {
        "id": 14,
        "title": "Безумная любовь",
        "description": "Но Го Джин – симпатичный и влиятельный математик. Его популярности позавидуют многие. Но где популярность, там и опасность. Го Джину угрожают смертью, и чтобы избежать это, он решается на авантюру. Молодой человек претворяется больным амнезией, а его секретарь Ли Джи Ён, к который он питает не очень приятные чувства, становится невестой. Как будут развиваться отношения между секретарем и математиком? Сможет ли главный герой избежать собственной смерти? На все эти и другие вопросы ответит дорама «Безумная любовь»!",
        "year": 2022,
        "country": "Южная Корея",
        "genres": ["Мелодрама", "Комедия", "Драма"],
        "img": "https://doramy.club/wp-content/uploads/2022/03/bezumnaya-lyubov-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    15: {
        "id": 15,
        "title": "Деловое предложение",
        "description": "Поддавшись на уговоры подруги и согласившись сходить на свидание вслепую, Син Ха Ри и подумать не могла, что вечер закончится предложением руки и сердца. К тому же ей пришлось притвориться другим человеком, а мужчина, который захотел на ней жениться, красивый и богатый бизнесмен, ни о чем не догадывается. Хуже того — он и есть тот новый генеральный директор компании, в которой работает Син Ха Ри.Как теперь будет выпутываться главная героиня, узнаем, посмотрев невероятно забавную и увлекательную дораму о офисных буднях.",
        "year": 2022,
        "country": "Южная Корея",
        "genres": ["Мелодрама", "Комедия"],
        "img": "https://doramy.club/wp-content/uploads/2022/03/delovoe-predlozhenie1-340x470.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    16: {
        "id": 16,
        "title": "К2 — Телохранитель дорама ",
        "description": "Бывший наемник под кодовым именем К2 был предан своими и вынужден скрываться от властей. Он вступает в игру грязных на руку политиков, чтобы найти и наказать главного виновника своего плачевного положения. На кон поставлена жизнь молодой девушки, дочери нынешнего президента Кореи, которую собственная семья удерживает и скрывает от общественности. К2 должен разобраться со злодеями и спасти невинную затворницу от уготованной ей участи. ",
        "year": 2016,
        "country": "Южная Корея",
        "genres": ["Боевик", "Драма", "Мелодрама", "Триллер"],
        "img": "https://doramy.club/wp-content/uploads/2017/05/k2.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    17: {
        "id": 17,
        "title": "Мы все плохо умеем любить",
        "description": "Сюжет мини-дорамы «Мы все плохо умеем любить» разворачивается вокруг двух лучших подруг — Фудзивара Ханаи Катаяма Мидзуки. Девушки дружат ещё с младшей школы, поэтому за эти годы стали чуть ли не ближе родственников. Когда Хана расстаётся с парнем, которого она уличила в измене, девушки решают развеяться. Они выбирают интересное место для совместного путешествия — горячие источники. По мнению подруг, это место поможет излечить их душевные раны. Здесь они знакомятся с двумя парнями. Даже несмотря на то, что знакомы они были всего ничего, молодые люди уже вступили в словесную перепалку. Неужели это и есть начало романтических отношений?",
        "year": 2020,
        "country": "Япония",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2020/11/my-vse-ploxo-umeem-lyubit.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    18: {
        "id": 18,
        "title": "Дон И ",
        "description": "Романтическая дорама «Дон И» поведает трогательную историю влюбленных из разных слоев общества. Еще с юных лет на судьбу бедняжки Дон И выпали тяжкие испытания. Она была вынуждена скитаться по улицам и питаться объедками до тех пор, пока девушку не приютила подруга ее брата.В сердце главной героини затаилась месть за своих близких, для осуществления которой она устраивается прачкой во дворец. Вскоре ей посчастливилось привлечь внимание самого Короля Сукчжона. Чтобы узнать, чем закончится история нашей героини, смотрите дораму Дон И.",
        "year": 2010,
        "country": "Южная Корея",
        "genres": ["Драма", "Исторический", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2017/08/don-i.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    19: {
        "id": 19,
        "title": "Энигма",
        "description": "В закрытой школе для девочек происходят странные вещи: в результате нервного срыва одна из учениц яростно нападает на учительницу. Инцидент замяли, но учительнице пришлось искать замену, и так в классе появляется молодой симпатичный, но весьма странный учитель Ачин. С виду рассеянный и дружелюбный, он вызывает подозрение, и две ученицы решают выяснить о нем правду. Чем это для них обернется? Смотрите сериал о мистических событиях в школе.",
        "year": 2023,
        "country": "Таиланд",
        "genres": ["Мистика", "Ужасы"],
        "img": "https://doramy.club/wp-content/uploads/2023/07/enigma.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    20: {
        "id": 20,
        "title": "Отель дель Луна",
        "description": "В самом сердце Сеула находится отель, который не в силах увидеть обычный человек. Чан Ман Воль, владелица этого отеля, уже больше тысячи лет не может покинуть этот мир и, наверное, никогда не сможет. Это место — её тюрьма в наказанье за поступок, совершенный в далёком прошлом. Ман Воль холодна и очень любит деньги, с годами она становится безразличнее по отношению к происходящим вокруг событиям. В её обязанности входит удовлетворять души умерших, забредших в отель. Однажды, не по своей воле, а из-за сделки отца, в отель приходит новый управляющий. Ку Чан Сон не может принять, что видит умерших и что ему придётся работать здесь. Однако, может быть, сама судьба свела этих двоих вместе?",
        "year": 2019,
        "country": "Таиланд",
        "genres": ["Мистика", "Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2019/06/otel-del-luna1.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    21: {
        "id": 21,
        "title": "Давай дерзай!",
        "description": "Главная героиня дорамы «Давай дерзай!» Кан Ён Ду, перевилась из обычной школы в элитную. Теперь ей предстоит наладить новые отношения с одноклассниками, которым важны лишь хорошие оценки.",
        "year": 2015 ,
        "country": "Южная Корея",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2017/06/davaj-derzaj.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    22: {
        "id": 22,
        "title": "",
        "description": "Мот работает служащим в отеле. Однажды он увидел, как Кэт, девушка по вызову, попала в неприятности, и выручает ее. Она часто оказывается в опасности из-за своей работы, и тогда он разработал для нее свой план, новую модель бизнеса: создать специальное приложение, чтобы общаться с клиентами напрямую, без посредников и дилеров. После некоторых сомнений Кэт соглашается на его авантюру, и вдвоем они совершают настоящую революцию в данной сфере. Чем обернется их затея, узнаем после просмотра.",
        "year": 2022 ,
        "country": "Таиланд",
        "genres": ["Криминал", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2022/12/polunochnyj-motel.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    23: {
        "id": 23 ,
        "title": "Национальное голосование за смертную казнь",
        "description": "Дорама расскажет о случаях преступников, которым удается избежать наказания. Если такое допускается, то неизвестные проводят голосование: должен ли человек, совершивший ужасное преступление, жить или умереть.После голосования, если большинство за смерть, неизвестный в собачьей маске вершит правосудие… Но Ким Му Чхан, сотрудник полицейского управления, против незаконных расправ и пытается найти того, кто жаждет справедливости. Удастся ли ему провернуть это дело? Смотрите напряженный детектив.",
        "year": 2023 ,
        "country": "Южная Корея",
        "genres": ["Детектив", "Криминал", "Триллер"],
        "img": "https://doramy.club/wp-content/uploads/2023/08/nacionalnoe-golosovanie-za-smertnuyu-kazn.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    24: {
        "id": 24 ,
        "title": "Семнадцатилетние",
        "description": "В дораме «Семнадцатилетние» мир вращается вокруг подростков! Именно так думают семнадцатилетние! Но для юного школьника Ох жизнь не такая беззаботная и счастливая как для остальных его сверстников. Ежедневный поход в школу стал для него настоящим адом, несмотря на то, что там учится его первая любовь – первая красавица школы.Ученик Ох самый настоящий ботаник в очках, за что и стал всеобщим «любимчиком»! А ежедневные подколы и издевки со стороны одноклассников стали для всех обычным делом. Устав от такого положения дел, Ох ставит для себя цель добиться расположения красавицы, а заодно и изменить отношение школьных товарищей!",
        "year": 2017 ,
        "country": "Таиланд",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2019/02/semnadcatiletnie.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    25: {
        "id": 25 ,
        "title": "Любит — не любит",
        "description": "Две главные героини сериала Акари и Юна очень разные: Акари открытая и дружелюбная, а Юна замкнутая и у нее мало друзей. Но несмотря на это они подружились и начали делиться друг с другом своими переживаниями.Так Акари узнала, что Юна влюблена в принца из манги, а Юна узнала о тайнах ее семьи. Затем Акари влюбляется в друга детства Юны, а её подруге очень нравится брат Акари. Отношения запутываются, всплывают секреты. Герои ссорятся, расстаются, но в итоге все вместе решают проблемы.",
        "year": 2020 ,
        "country": "Япония",
        "genres": ["Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2022/06/lyubit-ne-lyubit.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    26: {
        "id": 26 ,
        "title": "Друг на неделю ",
        "description": "Линь Сянчжи – прекрасная и милая девушка, молчаливая и закрытая в себе. К несчастью, она больна тяжелым заболеванием – посттравматическим стрессовым расстройством, которое подразумевает под собой полное забвение, связанное с друзьями. Как только Линь Сянчжи чувствовала себя счастливой и беззаботной в кругу друзей через неделю болезнь давала о себе знать – все воспоминания просто исчезали.Сюй Юшу – одноклассник нашей героини и просто хороший и добрый парень. Вместе с еще двумя товарищами он решает разделить участь Линь Сянчжи, став друзьями на неделю!",
        "year": 2022 ,
        "country": "Китай",
        "genres": ["Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2022/09/drug-na-nedelyu.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    27: {
        "id": 27 ,
        "title": "Любовная революция ",
        "description": "Сюжет дорамы «Любовная революция» разворачивается вокруг ученика старшей школы Гон Чжун Ёна. Он буквально с первого влюбляется в Чжа Рим, которая является чуть ли не самой популярной девушкой в школе. Проблема в том, что парень её совсем не привлекает и она не хочет принимать его чувства. Чжун Ён, несмотря на свой весьма мягкий характер, не намерен сдаваться. Молодой человек настойчиво решил, что хочет завоевать сердце сдержанной красотки, чего бы ему это не стоило, но вот получится ли у него, мы узнаем, посмотрев дораму.",
        "year": 2020,
        "country": "Южная Корея",
        "genres": ["Драма", "Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2020/09/lyubovnaya-revolyuciya.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    28: {
        "id": 28 ,
        "title": "Наедине с богами: Два мира",
        "description": "Фильм «Наедине с богами: Два мира» поведает о том, что происходит с человеком после смерти. Главный герой Ким Чжа Хон умер спасая жизнь ребенка, его встретили три хранителя загробного мира, которые должны защищать на семи страшных судах. Так как Чжа Хон благородная душа он сможет переродиться через 49 дней, избежав наказания за все смертные грехи, что не под силу обычным людям. Если это произойдет, то его защитники так же смогут переродиться. Но все не так просто как кажется, на каждом суде его ждут обвинители, которые так же хорошо подготовились, чтобы никто не остался безнаказанным. ",
        "year": 2017 ,
        "country": "Южная Корея",
        "genres": ["Драма", "Мистика", "Фэнтези"],
        "img": "https://doramy.club/wp-content/uploads/2018/02/naedine-s-bogami-dva-mira.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    29: {
        "id": 29 ,
        "title": "Наш фальшивый брак",
        "description": "Скромная и на первый взгляд непримечательная девушка Яэ работает в кафе и живет вместе с подругой, чтобы было проще оплачивать аренду квартиры. Но подруга принимает решение выйти замуж, а Яэ сначала увольняют с работы, а затем бросает парень.В этот сложный период жизни на её горизонте появляется друг детства Такуми. Узнав историю девушки, он предлагает ей сотрудничество, которое озадачивает её, ведь речь идет о том, чтобы исполнять роль фальшивой жены на протяжении полугода. Яэ вынуждена переступить через свои принципы, а Такуми не ожидал, что эта история с ненастоящим браком получит весьма приятное развитие. ",
        "year": 2023 ,
        "country": "Япония",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2023/10/nash-falshivyj-brak.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    30: {
        "id": 30 ,
        "title": "Заводила и принцесса",
        "description": "В центре внимания сюжета история отличницы Чжу Юнь и плохого парня Ли Синя. Чжу Юнь сама по себе очень тихая девушка, которая не очень любит быть в центре внимания. Но случайное знакомство со студентом Ли Сюнем, который отличается импульсивным нравом, меняет ее жизнь. Чем дальше она его узнает, тем сильнее он ей нравится. К тому же у них общие интересы и он приглашает девушку работать в свою команду, занимающуюся компьютерными исследованиями.Постепенно между главными героями возникают чувства, но последующие события приводят к размолвке. Справится ли пара со всеми испытаниями?",
        "year": 2022,
        "country": "Китай",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2022/11/zavodila-i-princessa.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    31: {
        "id": 31,
        "title": "Месть от третьего лица",
        "description": "Когда главной героине Ок Чан Ми сообщили, что ее брат-близнец покончил с собой, она в это не поверила, так как в тот день они общались по видеозвонку, который внезапно прервался.Никто не верит девушке, потому что у нее нет доказательств, а телефон на месте преступления не был найден. Но Ок Чан Ми не сдается. Вместе с парнем по имени Чжи Су Хон, который защищает слабых учеников от издевательств в школе, она пытается докопаться до истины. В чем же был замешан ее брат? Получится ли у них найти истинную причину его гибели?",
        "year": 2022,
        "country": "Южная Корея",
        "genres": ["Драма", "Триллер"],
        "img": "https://doramy.club/wp-content/uploads/2022/11/mest-drugix.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    32: {
        "id": 32 ,
        "title": "Я не робот!",
        "description": "В комедийной дораме «Я не робот!» молодой бизнесмен Ким Мин Кю страдает от аллергии. Однако его случай уникален, от прикосновения к другому человеку у парня начинается сильное раздражение кожи. В такой ситуации Мин Кю страдает от одиночества и нехватки романтических отношений. Что же делать, неужели он так и останется вечно один. На помощь бедолаге приходят новые технологии, группа ученых утверждает, что сделали робота, которого совершенно не отличить от человека.",
        "year": 2017 ,
        "country": "Южная Корея",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2017/12/ya-ne-robot.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    33: {
        "id": 33 ,
        "title": "Записки юности ",
        "description": "Дорама расскажет историю трех молодых людей на пути к осуществлению своей мечты в модельном бизнесе. Са Хе Джун и Вон Хэ Хё друзья и у них общая цель — стать успешными в шоу-бизнезе. Хэ Хё уже достиг своей цели — он популярный актер и модель, но его тяготит тот факт, что люди за спиной судачат о его богатой семье и принижают его талан и усердие. Са Хе — родился в обычной семье и ему трудно пробиться на вершину, отсутствие поддержки даже моральной со стороны отца заставляет его сомневаться в правильности своего выбора, но он не сдается и делает все возможное для достижения цели. Он встречает Ан Чон Ха — девушку-визажиста, которая так же отчаянно следует своим убеждениям и борется с трудностями на своем пути.",
        "year": 2020 ,
        "country": "Южная Корея",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2020/08/zapiski-yunosti.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    34: {
        "id": 34 ,
        "title": "Сад падающих звёзд ",
        "description": "Сюжет дорамы «Сад падающих звёзд» разворачивается вокруг восемнадцатилетний девушки Шань Цай. Она живет в бедной семье, но получает уникальный шанс поступить в элитную школу, где учатся самые богатые детишки со всей страны. Наша героиня оказывается среди высокомерных и испорченных учеников, общаться с которыми она явно не привыкла. Вот только Шань Цай оказывается не из робких девчонок и вполне хорошо держится далеко не в самом дружелюбном обществе. В новой школе ей приходиться нелегко, но в самый неожиданный момент ее начинает поддерживать юноша Хуа Зе Лей, входящий в группу самых богатых и классных парней. Чтобы узнать, как будут развиваться дальнейшие события, смотрите сериал, который является новой адаптацией манги «Цветочки после ягодок».",
        "year": 2018 ,
        "country": "Китай",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2018/07/sad-padayushhix-zvyozd.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/HgygJV7pibE",
            "title": "Отрывки из дорамы Любовь, которую ты даришь мне"
        }
    },
    35: {
        "id": 35,
        "title": "Мини и Макс",
        "description": "Легкий и романтический сюжет фильма «Мини и Макс» разворачивается вокруг молодой студентки Ся Силин и статного высокого парня Джан Сяо. Ся Силин учится на втором курсе факультета психологии и с давних времен испытывает неудобства из-за маленького роста. На факультете ей даже дали обидное прозвище «Мини»! Пытаясь хоть как-то исправить свою репутацию, Ся Силин решает стать «выше» остальных в учебе, спортивных играх и различных студенческих общественных мероприятиях. В один момент ей все это удается, и кажется, с обидным прозвищем покончено. Однако нужда заставляет Ся Силин устроиться на работу, тут то и начинаются ее настоящие приключения!",
        "year": 2016 ,
        "country": "Китай",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2019/06/mini-i-maks.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/6B0waDeRpl4",
            "title": "Отрывки из дорамыМини и Макс"
        }
    },
    36: {
        "id": 36 ,
        "title": "Новый уровень ",
        "description": "Главный герой дорамы «Новый уровень» Ан Данте, директор фирмы, специализирующейся на реструктуризации компаний. Он хладнокровен и отлично умеет скрывать свои эмоции. Шин Ён Хва — руководит разработкой новой игры в компании Joybuster, которая находиться на грани банкротства. Чтобы изменить текущее положение дел, Ан Данте назначают новым генеральным директором этой компании. Теперь Ён Хва будет работать под его руководством, вот только новые коллеги никак не могут поладить и цепляются друг к другу по поводу и без.",
        "year": 2019 ,
        "country": "Южная Корея",
        "genres": ["Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2019/06/novyj-uroven.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/SrP93xCkHk0",
            "title": "Отрывки из дорамы Новый уровень"
        }
    },
    37: {
        "id": 37 ,
        "title": "Розовый грех ",
        "description": "В сердце молодого парня Патсакона затаилась злоба на собственного отца, ведь от горя и бед умерла его мать. Долгое время он был замкнутым в себе человеком, который ненавидит словно целый мир. Так продолжалось до тех пор, пока в жизни нашего героя не появляется добрая и позитивная девушка Кансадан. Даже на самые сложные ситуации она смотрит с оптимизмом и становится словно лучиком света в жизни Патсакона. У этой пары все складывалось просто идеально, но в один момент, отец которого так ненавидит Патсакона, решает жениться на матери Кансадан. Теперь она может стать его приемной дочерью, что сильно обостряет отношения между главными героями. Зрителям предстоит увидеть очень непростую историю любви.",
        "year": 2018,
        "country": "Таиланд",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2018/11/rozovyj-grex.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/jugoNdffuM4",
            "title": "Отрывки из дорамы Розовый грех"
        }
    },
    38: {
        "id": 38 ,
        "title": "Каменное сердце",
        "description": "Главный герой дорамы «Каменное сердце» Тор, после смерти матери вынужден жить в семье своего богатого отца. Так как мальчик незаконнорожденный ребенок, да еще и от проститутки, его мачеха и брат делают жизнь нежеланного родственника ужасной. Лишь одно обстоятельство делает жизнь мальчика светлее — это девочка по имени Мингта, которая также терпит притеснения со стороны членов своей семьи. Однажды в результате погони мачехи за Тором, ребенок прыгает в реку и считается мертвым, но выживает. С этого момента герой меняет имя на Сила и его воспитывает подруга матери, проститутка. Спустя годы уже взрослый и возмужавший Сила возвращается в родные пенаты, он богатый сутенер. Все это время парень мечтал отомстить своим обидчикам и придумал план, но в его схеме появилась помеха — та самая девочка, которая была для него отдушиной, похоже узнала Тора.",
        "year": 2019 ,
        "country": "Таиланд",
        "genres": ["Драма", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2019/04/kamennoe-serdce.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/W4ID_SsPDl",
            "title": "Клип к лакорну Каменное сердце"
        }
    },
    39: {
        "id": 39 ,
        "title": "Люди с недостатками",
        "description": "Главная героиня романтической комедии «Люди с недостатками» Чжу Со Ён, работает учителем физкультуры в средней школе. В прошлом девушке нравились мальчики-красавчики, но со временем она стала их недолюбливать, теперь ей нравятся обычные мужчины, а красавчиков она на дух не переносит. Именно таким симпатягой, одержимым своей внешностью, является Ли Кан Ву, который специально перевелся с школу, где работает Со Ён. Пятнадцать лед назад эта парочка училась в одной школе и Кан Ву был пухленьким непривлекательным парнем, из-за героини у него развилась мания красивой внешности и сопутствующее заболевании кишечника. Спустя годы молодой человек стал весьма привлекательным, осознав, что все его проблемы были из-за Со Ён, он становится председателем школьного совета, вот только и на этот раз Кан Ву в немилости, ведь девушка теперь ненавидит таких как он.",
        "year": 2019,
        "country": "Южная Корея",
        "genres": ["Драма", "Комедия", "Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2019/11/lyudi-s-nedostatkami.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/-NTt1wouIuU",
            "title": "Люди с недостатками  трейлер"
        }
    },
    40: {
        "id": 40 ,
        "title": "Грешная любовь среди волн океана ",
        "description": "Главная героиня лакорна «Грешная любовь среди волн океана» молодая, добрая девушка Ум, сбегает из дома мачехи вместе со своей младшей сестрой. Жизнь девушки и так была не сахар — мать умерла, отец женился на другой женщине со взрослой дочерью, привел в семью дочь со стороны, постоянно проигрывает деньги в азартные игры. Дошло до того, что мачеха продала ее кредиторам и у девушки просто не осталось выбора как сбежать куда глаза глядят.Ум повезло с подругой, которая помогла ей с побегом, вместе они отправились на побережье к ее тете, где она знакомится с молодым красавцем, владельцем курорта Сатра. И все могло сложиться просто идеально, если бы не ее отец, который причастен к гибели родителей парня. Узнав чьей дочерью является Ум, Сатра решает отомстить, сделав жизнь девушки невыносимой. Но постепенно боль которую он причинял бедняжке начала ранить и его самого. Сможет ли главная героиня после всех обид и горестей простить Сатра.  ",
        "year": 2017 ,
        "country": "Таиланд",
        "genres": ["Мелодрама"],
        "img": "https://doramy.club/wp-content/uploads/2018/03/greshnaya-lyubov.jpg",
        "trailer": {
            "url": "https://www.youtube.com/embed/zJ54kIodmAQ",
            "title": "Отрывки из дорамы Грешная любовь среди волн океана"
        }
    }
}

localStorage.setItem('Doramas', JSON.stringify(doramas));

const users = localStorage.getItem('Users');
if (!users)
    localStorage.setItem('Users', JSON.stringify({}));